app/Controllers/User.php

SELECT *
FROM `gitar`
---
    public function contentbased()
    {
        $contentbased = $this->GitarModel->findAll();