app/Models/GitarModel.php

    public function getGitarRekomendasi($jenis, $ukuran, $warna, $harga)
    {

        $builder = $this->db->table("gitar");
        $builder->select('gitar.id_merk, gitar.id_gitar, gitar.harga,gitar.gambar, gitar.nama, gitar.warna, gitar.jenis, gitar.ukuran, gitar.hasil ,gitar.gambar');
        // $builder->join('merk', 'merk.id_merk= gitar.id_merk', "left");
        $builder->where('jenis', $jenis);
        $builder->where('ukuran', $ukuran);
        $builder->where('warna', $warna);
        $builder->where('harga', $harga);
        $data = $builder->get()->getResult();
---
SELECT `gitar`.`id_merk`, `gitar`.`id_gitar`, `gitar`.`harga`, `gitar`.`gambar`, `gitar`.`nama`, `gitar`.`warna`, `gitar`.`jenis`, `gitar`.`ukuran`, `gitar`.`hasil`, `gitar`.`gambar`
FROM `gitar`
WHERE `jenis` = 'Akustik'
AND `ukuran` = 'Normal'
AND `warna` = 'Natural'
AND `harga` = 'Terjangkau'