app/Models/ProsesGitarModel.php

SELECT *
FROM `proses_gitar`
WHERE `hasil` = 'Dicari'
AND `status` = 1
---
    public function getcari()
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('hasil', "Dicari");
        $builder->where('status', 1);
        $query = $builder->get(); // Eksekusi kueri

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `hasil` = 'Disukai'
AND `status` = 1
---
    public function getsuka()
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('hasil', "Disukai");
        $builder->where('status', 1);
        $data = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `hasil` = 'Tidak'
AND `status` = 1
---
    public function gettidakdisukai()
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('hasil', "Tidak");
        $builder->where('status', 1);

        $data = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `proses_gitar`.`jenis` = 'Akustik'
AND `proses_gitar`.`hasil` = 'Disukai'
---
    public function getjenisdisukai($jenis)
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('proses_gitar.jenis=', $jenis);
        $builder->where('proses_gitar.hasil=', "Disukai");
        $data = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `proses_gitar`.`jenis` = 'Akustik'
AND `proses_gitar`.`hasil` = 'Tidak'
---
    public function getjenistidakdisukai($jenis)
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('proses_gitar.jenis', $jenis);
        $builder->where('proses_gitar.hasil=', "Tidak");
        $data = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `proses_gitar`.`ukuran` = 'Normal'
AND `proses_gitar`.`hasil` = 'Disukai'
---
    public function getukurandisukai($ukuran)
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('proses_gitar.ukuran', $ukuran);
        $builder->where('proses_gitar.hasil=', "Disukai");
        $data = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `proses_gitar`.`ukuran` = 'Normal'
AND `proses_gitar`.`hasil` = 'Tidak'
---
    public function getukurantidakdisukai($ukuran)
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('proses_gitar.ukuran', $ukuran);
        $builder->where('proses_gitar.hasil=', "Tidak");
        $data = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `proses_gitar`.`warna` = 'Natural'
AND `proses_gitar`.`hasil` = 'Disukai'
---
    public function getwarnadisukai($warna)
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('proses_gitar.warna', $warna);
        $builder->where('proses_gitar.hasil=', "Disukai");
        $data = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `proses_gitar`.`warna` = 'Natural'
AND `proses_gitar`.`hasil` = 'Tidak'
---
    public function getwarnatidakdisukai($warna)
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('proses_gitar.warna', $warna);
        $builder->where('proses_gitar.hasil', "Tidak");
        $data = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `proses_gitar`.`harga` = 'Terjangkau'
AND `proses_gitar`.`hasil` = 'Disukai'
---
    public function getukhargadisukai($harga)
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('proses_gitar.harga', $harga);
        $builder->where('proses_gitar.hasil', "Disukai");
        $data = $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `proses_gitar`
WHERE `proses_gitar`.`harga` = 'Terjangkau'
AND `proses_gitar`.`hasil` = 'Tidak'
---
    public function gethargatidakdisukai($harga)
    {
        $builder = $this->db->table("proses_gitar");
        $builder->where('proses_gitar.harga', $harga);
        $builder->where('proses_gitar.hasil', "Tidak");
        $data = $builder->countAllResults();